/**
 ****************************************************************************************************
 * @file        timer.h
 * @author      AI Assistant
 * @version     V1.0
 * @date        2026-07-28
 * @brief       高分辨率定时器驱动代码
 ****************************************************************************************************
 * @attention
 *
 ****************************************************************************************************
 */

#ifndef __TIMER_H_
#define __TIMER_H_

#include <stdint.h>
#include "esp_timer.h"

/* 函数声明 */
void timer_init(uint64_t period_us);  /* 初始化并启动高分辨率定时器，period_us 为周期（微秒） */

#endif
